'''
2292. 벌집

[문제]
육각형으로 이루어진 벌집이 있다. 
그림에서 보는 바와 같이 중앙의 방 1부터 시작해서 이웃하는 방에 돌아가면서 1씩 증가하는 번호를 주소로 매길 수 있다. 
숫자 N이 주어졌을 때, 
벌집의 중앙 1에서 N번 방까지 최소 개수의 방을 지나서 갈 때 몇 개의 방을 지나가는지(시작과 끝을 포함하여)를 계산하는 프로그램을 작성하시오. 
예를 들면, 13까지는 3개, 58까지는 5개를 지난다.

[입력]
첫째 줄에 N(1 ≤ N ≤ 1,000,000,000)이 주어진다.

[출력]
입력으로 주어진 방까지 최소 개수의 방을 지나서 갈 때 몇 개의 방을 지나는지 출력한다.
'''
N = int(input())
number = 1
hexagon = 1
while N > number:
    number += 6*hexagon
    hexagon += 1

print(hexagon)


# [[1, 2, 9, 22], [1, 3, 11, 25], [1, 4, 13, 28], [1, 5, 15, 31], [1, 6, 17, 34], [1, 7, 19, 37]]...
# arr = [[1], [1], [1], [1], [1], [1] ]
# sum = 1
# move = 1
# idx = 0
# for n in range(3):
#     for i in range(6):
#         arr[i].append(arr[i][n] + sum + i + n*6)
# for i in range(6):
#     if 13 in arr[i]:
#         print(arr[i])
#         idx = arr[i].index(13)
# move += idx
# print(move)
